Hi @Jakomaro , 👋 

I can confirm that this works with the following:

- VMware vSphere 7.0.3
- Hashicorp Terraform 1.2.2
  - Offical Container Image: `hashicorp/terraform`
  - My Container Image: `tenthirtyam/terraform`
- Terraform provider for VMware vSphere v2.1.1

Here's my Linux + cloud init example that I used for a Ubuntu 22.04 LTS template which defaults to the cloud-init VMware datasource for customizations.

- Terraform Example: [`r/virtual_machine` + cloud-init](https://github.com/tenthirtyam/terrafom-examples-vmware/tree/main/vsphere/vsphere-virtual-machine/clone-template-linux-cloud-init)
- Packer Build: From my project [vmware-samples/packer-examples-for-vsphere](https://github.com/vmware-samples/packer-examples-for-vsphere) 
  (Note: Requires vSphere 7.0.2 and higher)

**Results:**

`terraform version`

```console
❯ docker run --rm -it --name terraform -v $(pwd):/tmp -w /tmp hashicorp/terraform:light version
Terraform v1.2.2
on linux_amd64
```

`terraform init`

```console
❯ docker run --rm -it --name terraform -v $(pwd):/tmp -w /tmp hashicorp/terraform:light init

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/vsphere versions matching "2.1.1"...
- Installing hashicorp/vsphere v2.1.1...
- Installed hashicorp/vsphere v2.1.1 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```

`terraform plan`

```console
❯ docker run --rm -it --name terraform -v $(pwd):/tmp -w /tmp hashicorp/terraform:light plan
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_network.network: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_datastore.datastore: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_network.network: Read complete after 0s [id=network-1001]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c6045]
data.vsphere_datastore.datastore: Read complete after 0s [id=datastore-11]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-6046]
data.vsphere_virtual_machine.template: Read complete after 0s [id=42025e4b-031d-1f3e-95c9-c4e0861d73bf]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = "automatic"
      + extra_config                            = {
          + "guestinfo.metadata"          = "aW5zdGFuY2UtaWQ6IGdoLTE2NjgtdWJ1bnR1LTIyMDQKbG9jYWwtaG9zdG5hbWU6IGdoLTE2NjgtdWJ1bnR1LTIyMDQKbmV0d29yazoKICB2ZXJzaW9uOiAyCiAgZXRoZXJuZXRzOgogICAgZW5zMTkyOgogICAgICBkaGNwNDogZmFsc2UKICAgICAgYWRkcmVzc2VzOgogICAgICAgIC0gMTcyLjE2LjExLjE5Mi8yNAogICAgICBnYXRld2F5NDogMTcyLjE2LjExLjEKICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgYWRkcmVzc2VzOgogICAgICAgICAgLSAxNzIuMTYuMTEuMTEKICAgICAgICAgIC0gMTcyLjE2LjExLjEyCg=="
          + "guestinfo.metadata.encoding" = "base64"
          + "guestinfo.userdata"          = "I2Nsb3VkLWNvbmZpZwoKdXNlcnM6CiAgLSBkZWZhdWx0CiAgLSBuYW1lOiByYWlucG9sZQogICAgcHJpbWFyeV9ncm91cDogcmFpbnBvbGUKICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwKICAgIGdyb3Vwczogc3Vkbywgd2hlZWwKICAgIHNzaF9pbXBvcnRfaWQ6IE5vbmUKICAgIGxvY2tfcGFzc3dkOiB0cnVlCiAgICBzc2hfYXV0aG9yaXplZF9rZXlzOgogICAgLSA8cHVibGljX2tleT4K"
          + "guestinfo.userdata.encoding" = "base64"
        }
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "ubuntu64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "gh-1668-ubuntu-2204"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "42025e4b-031d-1f3e-95c9-c4e0861d73bf"
          + timeout       = 30
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 40
          + storage_policy_id = (known after apply)
          + thin_provisioned  = false
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

`terraform apply`

```console
❯ docker run --rm -it --name terraform -v $(pwd):/tmp -w /tmp hashicorp/terraform:light apply --auto-approve
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_network.network: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_datastore.datastore: Reading...
data.vsphere_datastore.datastore: Read complete after 0s [id=datastore-11]
data.vsphere_network.network: Read complete after 0s [id=network-1001]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c6045]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-6046]
data.vsphere_virtual_machine.template: Read complete after 0s [id=42025e4b-031d-1f3e-95c9-c4e0861d73bf]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-11"
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = true
      + ept_rvi_mode                            = "automatic"
      + extra_config                            = {
          + "guestinfo.metadata"          = "aW5zdGFuY2UtaWQ6IGdoLTE2NjgtdWJ1bnR1LTIyMDQKbG9jYWwtaG9zdG5hbWU6IGdoLTE2NjgtdWJ1bnR1LTIyMDQKbmV0d29yazoKICB2ZXJzaW9uOiAyCiAgZXRoZXJuZXRzOgogICAgZW5zMTkyOgogICAgICBkaGNwNDogZmFsc2UKICAgICAgYWRkcmVzc2VzOgogICAgICAgIC0gMTcyLjE2LjExLjE5Mi8yNAogICAgICBnYXRld2F5NDogMTcyLjE2LjExLjEKICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgYWRkcmVzc2VzOgogICAgICAgICAgLSAxNzIuMTYuMTEuMTEKICAgICAgICAgIC0gMTcyLjE2LjExLjEyCg=="
          + "guestinfo.metadata.encoding" = "base64"
          + "guestinfo.userdata"          = "I2Nsb3VkLWNvbmZpZwoKdXNlcnM6CiAgLSBkZWZhdWx0CiAgLSBuYW1lOiByYWlucG9sZQogICAgcHJpbWFyeV9ncm91cDogcmFpbnBvbGUKICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwKICAgIGdyb3Vwczogc3Vkbywgd2hlZWwKICAgIHNzaF9pbXBvcnRfaWQ6IE5vbmUKICAgIGxvY2tfcGFzc3dkOiB0cnVlCiAgICBzc2hfYXV0aG9yaXplZF9rZXlzOgogICAgLSA8cHVibGljX2tleT4K"
          + "guestinfo.userdata.encoding" = "base64"
        }
      + firmware                                = "efi"
      + folder                                  = "workloads"
      + force_power_off                         = true
      + guest_id                                = "ubuntu64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "gh-1668-ubuntu-2204"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6046"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "42025e4b-031d-1f3e-95c9-c4e0861d73bf"
          + timeout       = 30
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 40
          + storage_policy_id = (known after apply)
          + thin_provisioned  = false
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-1001"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
vsphere_virtual_machine.vm: Creating...
vsphere_virtual_machine.vm: Still creating... [10s elapsed]
vsphere_virtual_machine.vm: Still creating... [20s elapsed]
vsphere_virtual_machine.vm: Still creating... [30s elapsed]
vsphere_virtual_machine.vm: Still creating... [40s elapsed]
vsphere_virtual_machine.vm: Still creating... [50s elapsed]
vsphere_virtual_machine.vm: Creation complete after 51s [id=4202a033-d2bb-b0d2-de0a-dc3d4426958c]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

<img width="1070" alt="image" src="https://user-images.githubusercontent.com/7771363/172713044-3587b8f1-902c-4a60-ae32-363744f727cd.png">

`terraform destroy`

(I switched containers here....)

```console
❯ docker run --rm -it --name terraform -v $(pwd):/tmp -w /tmp tenthirtyam/terraform destroy --auto-approve
data.vsphere_datacenter.datacenter: Reading...
data.vsphere_datacenter.datacenter: Read complete after 0s [id=datacenter-3]
data.vsphere_network.network: Reading...
data.vsphere_datastore.datastore: Reading...
data.vsphere_compute_cluster.cluster: Reading...
data.vsphere_virtual_machine.template: Reading...
data.vsphere_network.network: Read complete after 0s [id=network-1001]
data.vsphere_datastore.datastore: Read complete after 0s [id=datastore-11]
data.vsphere_compute_cluster.cluster: Read complete after 0s [id=domain-c6045]
data.vsphere_resource_pool.pool: Reading...
data.vsphere_resource_pool.pool: Read complete after 0s [id=resgroup-6046]
data.vsphere_virtual_machine.template: Read complete after 0s [id=42025e4b-031d-1f3e-95c9-c4e0861d73bf]
vsphere_virtual_machine.vm: Refreshing state... [id=4202a033-d2bb-b0d2-de0a-dc3d4426958c]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # vsphere_virtual_machine.vm will be destroyed
  - resource "vsphere_virtual_machine" "vm" {
      - annotation                              = <<-EOT
            Version: v22.06
            Built on: 2022-06-08 19:44 UTC
            Built by: HashiCorp Packer 1.8.1
        EOT -> null
      - boot_delay                              = 0 -> null
      - boot_retry_delay                        = 10000 -> null
      - boot_retry_enabled                      = false -> null
      - change_version                          = "2022-06-08T20:30:08.601106Z" -> null
      - cpu_hot_add_enabled                     = false -> null
      - cpu_hot_remove_enabled                  = false -> null
      - cpu_limit                               = -1 -> null
      - cpu_performance_counters_enabled        = false -> null
      - cpu_reservation                         = 0 -> null
      - cpu_share_count                         = 2000 -> null
      - cpu_share_level                         = "normal" -> null
      - custom_attributes                       = {} -> null
      - datastore_id                            = "datastore-11" -> null
      - default_ip_address                      = "172.16.11.192" -> null
      - efi_secure_boot_enabled                 = true -> null
      - enable_disk_uuid                        = false -> null
      - enable_logging                          = false -> null
      - ept_rvi_mode                            = "automatic" -> null
      - extra_config                            = {
          - "guestinfo.metadata"          = "aW5zdGFuY2UtaWQ6IGdoLTE2NjgtdWJ1bnR1LTIyMDQKbG9jYWwtaG9zdG5hbWU6IGdoLTE2NjgtdWJ1bnR1LTIyMDQKbmV0d29yazoKICB2ZXJzaW9uOiAyCiAgZXRoZXJuZXRzOgogICAgZW5zMTkyOgogICAgICBkaGNwNDogZmFsc2UKICAgICAgYWRkcmVzc2VzOgogICAgICAgIC0gMTcyLjE2LjExLjE5Mi8yNAogICAgICBnYXRld2F5NDogMTcyLjE2LjExLjEKICAgICAgbmFtZXNlcnZlcnM6CiAgICAgICAgYWRkcmVzc2VzOgogICAgICAgICAgLSAxNzIuMTYuMTEuMTEKICAgICAgICAgIC0gMTcyLjE2LjExLjEyCg=="
          - "guestinfo.metadata.encoding" = "base64"
          - "guestinfo.userdata"          = "I2Nsb3VkLWNvbmZpZwoKdXNlcnM6CiAgLSBkZWZhdWx0CiAgLSBuYW1lOiByYWlucG9sZQogICAgcHJpbWFyeV9ncm91cDogcmFpbnBvbGUKICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwKICAgIGdyb3Vwczogc3Vkbywgd2hlZWwKICAgIHNzaF9pbXBvcnRfaWQ6IE5vbmUKICAgIGxvY2tfcGFzc3dkOiB0cnVlCiAgICBzc2hfYXV0aG9yaXplZF9rZXlzOgogICAgLSA8cHVibGljX2tleT4K"
          - "guestinfo.userdata.encoding" = "base64"
        } -> null
      - firmware                                = "efi" -> null
      - folder                                  = "workloads" -> null
      - force_power_off                         = true -> null
      - guest_id                                = "ubuntu64Guest" -> null
      - guest_ip_addresses                      = [
          - "172.16.11.192",
          - "fe80::250:56ff:fe82:1cae",
        ] -> null
      - hardware_version                        = 19 -> null
      - host_system_id                          = "host-10" -> null
      - hv_mode                                 = "hvAuto" -> null
      - id                                      = "4202a033-d2bb-b0d2-de0a-dc3d4426958c" -> null
      - ide_controller_count                    = 2 -> null
      - latency_sensitivity                     = "normal" -> null
      - memory                                  = 4096 -> null
      - memory_hot_add_enabled                  = false -> null
      - memory_limit                            = -1 -> null
      - memory_reservation                      = 0 -> null
      - memory_share_count                      = 40960 -> null
      - memory_share_level                      = "normal" -> null
      - migrate_wait_timeout                    = 30 -> null
      - moid                                    = "vm-85006" -> null
      - name                                    = "gh-1668-ubuntu-2204" -> null
      - nested_hv_enabled                       = false -> null
      - num_cores_per_socket                    = 1 -> null
      - num_cpus                                = 2 -> null
      - pci_device_id                           = [] -> null
      - power_state                             = "on" -> null
      - poweron_timeout                         = 300 -> null
      - reboot_required                         = false -> null
      - resource_pool_id                        = "resgroup-6046" -> null
      - run_tools_scripts_after_power_on        = true -> null
      - run_tools_scripts_after_resume          = true -> null
      - run_tools_scripts_before_guest_reboot   = false -> null
      - run_tools_scripts_before_guest_shutdown = true -> null
      - run_tools_scripts_before_guest_standby  = true -> null
      - sata_controller_count                   = 0 -> null
      - scsi_bus_sharing                        = "noSharing" -> null
      - scsi_controller_count                   = 1 -> null
      - scsi_type                               = "pvscsi" -> null
      - shutdown_wait_timeout                   = 3 -> null
      - swap_placement_policy                   = "inherit" -> null
      - sync_time_with_host                     = false -> null
      - sync_time_with_host_periodically        = false -> null
      - tags                                    = [] -> null
      - tools_upgrade_policy                    = "manual" -> null
      - uuid                                    = "4202a033-d2bb-b0d2-de0a-dc3d4426958c" -> null
      - vapp_transport                          = [] -> null
      - vbs_enabled                             = false -> null
      - vmware_tools_status                     = "guestToolsRunning" -> null
      - vmx_path                                = "gh-1668-ubuntu-2204/gh-1668-ubuntu-2204.vmx" -> null
      - vvtd_enabled                            = false -> null
      - wait_for_guest_ip_timeout               = 0 -> null
      - wait_for_guest_net_routable             = true -> null
      - wait_for_guest_net_timeout              = 5 -> null

      - clone {
          - linked_clone    = false -> null
          - ovf_network_map = {} -> null
          - ovf_storage_map = {} -> null
          - template_uuid   = "42025e4b-031d-1f3e-95c9-c4e0861d73bf" -> null
          - timeout         = 30 -> null
        }

      - disk {
          - attach           = false -> null
          - controller_type  = "scsi" -> null
          - datastore_id     = "datastore-11" -> null
          - device_address   = "scsi:0:0" -> null
          - disk_mode        = "persistent" -> null
          - disk_sharing     = "sharingNone" -> null
          - eagerly_scrub    = false -> null
          - io_limit         = -1 -> null
          - io_reservation   = 0 -> null
          - io_share_count   = 1000 -> null
          - io_share_level   = "normal" -> null
          - keep_on_remove   = false -> null
          - key              = 2000 -> null
          - label            = "disk0" -> null
          - path             = "gh-1668-ubuntu-2204/gh-1668-ubuntu-2204.vmdk" -> null
          - size             = 40 -> null
          - thin_provisioned = false -> null
          - unit_number      = 0 -> null
          - uuid             = "6000C293-4320-b556-31ee-27298702acca" -> null
          - write_through    = false -> null
        }

      - network_interface {
          - adapter_type          = "vmxnet3" -> null
          - bandwidth_limit       = -1 -> null
          - bandwidth_reservation = 0 -> null
          - bandwidth_share_count = 50 -> null
          - bandwidth_share_level = "normal" -> null
          - device_address        = "pci:0:7" -> null
          - key                   = 4000 -> null
          - mac_address           = "00:50:56:82:1c:ae" -> null
          - network_id            = "network-1001" -> null
          - use_static_mac        = false -> null
        }
    }

Plan: 0 to add, 0 to change, 1 to destroy.
vsphere_virtual_machine.vm: Destroying... [id=4202a033-d2bb-b0d2-de0a-dc3d4426958c]
vsphere_virtual_machine.vm: Destruction complete after 6s

Destroy complete! Resources: 1 destroyed.
```

Give the above example plan a try and let me know your results.

Here's a copy of the files, too:  [gh-1668.zip](https://github.com/hashicorp/terraform-provider-vsphere/files/8864947/gh-1668.zip).

**Ryan Johnson**
Staff II Solutions Architect | VMware, Inc.
